OpenNuvoton/M253BSP/Library/StdDriver/src/i2c.c
            case 0x18:                                                    /* Slave Address ACK */
                I2C_SET_DATA(i2c, (uint8_t)((u16DataAddr & 0xFF00U) >> 8U));/* Write Hi byte address of register */
                break;

            case 0x20:                                                    /* Slave Address NACK */
            case 0x30:                                                    /* Master transmit data NACK */
                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1U;
                break;

            case 0x28:
                if (u8Addr)
                {
                    I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFU));     /* Write Lo byte address of register */
                    u8Addr = 0U;
                }
                else
                {
                    u8Ctrl = I2C_CTL_STA_SI;                              /* Clear SI and send repeat START */
                }

                break;

            case 0x10:
                I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1U) | 0x01U));           /* Write SLA+R to Register I2CDAT */
                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
                break;

            case 0x40:                                                    /* Slave Address ACK */
                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
                break;

            case 0x48:                                                    /* Slave Address NACK */
                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1U;
                break;

            case 0x58:
                rdata = (uint8_t) I2C_GET_DATA(i2c);                /* Receive Data */
                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Xfering = 0U;
                break;

            case 0x38:                                                    /* Arbitration Lost */
            default:                                                      /* Unknow status */
                I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                 /* Clear SI and send STOP */
                u8Ctrl = I2C_CTL_SI;
                u8Err = 1U;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                             /* Write controlbit to I2C_CTL register */
    }

    if (u8Err)
    {
        rdata = 0U;                                                    /* If occurs error, return 0 */
    }

    return rdata;                                                     /* Return read data */
}

/**
  * @brief      Specify two bytes register address and read multi bytes from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data read from
  * @param[out] rdata[]         A data array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify two bytes address that multi data bytes read from Slave.
  *
  *
  */
uint32_t I2C_ReadMultiBytesTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1U, u8Err = 0U, u8Addr = 1U, u8Ctrl = 0U;
    uint32_t u32rxLen = 0U;

    I2C_START(i2c);                                                   /* Send START */

    while (u8Xfering && (u8Err == 0U))
    {
        I2C_WAIT_READY(i2c) {}

        switch (I2C_GET_STATUS(i2c))
        {
            case 0x08:
                I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1U | 0x00U));             /* Write SLA+W to Register I2CDAT */
                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
                break;

            case 0x18:                                                    /* Slave Address ACK */
                I2C_SET_DATA(i2c, (uint8_t)((u16DataAddr & 0xFF00U) >> 8U));/* Write Hi byte address of register */
                break;

            case 0x20:                                                    /* Slave Address NACK */
            case 0x30:                                                    /* Master transmit data NACK */
                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1U;
                break;

            case 0x28:
                if (u8Addr)
                {
                    I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFU));     /* Write Lo byte address of register */
                    u8Addr = 0U;
                }
                else
                {
                    u8Ctrl = I2C_CTL_STA_SI;                              /* Clear SI and send repeat START */
                }

                break;

            case 0x10:
                I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1U) | 0x01U));           /* Write SLA+R to Register I2CDAT */
                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
                break;

            case 0x40:                                                    /* Slave Address ACK */
                u8Ctrl = I2C_CTL_SI_AA;                                   /* Clear SI and set ACK */
                break;

            case 0x48:                                                    /* Slave Address NACK */
                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1U;
                break;

            case 0x50:
                rdata[u32rxLen++] = (uint8_t) I2C_GET_DATA(i2c);    /* Receive Data */

                if (u32rxLen < (u32rLen - 1U))
                {
                    u8Ctrl = I2C_CTL_SI_AA;                               /* Clear SI and set ACK */
                }
                else
                {
                    u8Ctrl = I2C_CTL_SI;                                  /* Clear SI */
                }

                break;

            case 0x58:
                rdata[u32rxLen++] = (uint8_t) I2C_GET_DATA(i2c);    /* Receive Data */
                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Xfering = 0U;
                break;

            case 0x38:                                                    /* Arbitration Lost */
            default:                                                      /* Unknow status */
                I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                 /* Clear SI and send STOP */
                u8Ctrl = I2C_CTL_SI;
                u8Err = 1U;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                             /* Write controlbit to I2C_CTL register */
    }

    return u32rxLen;                                                  /* Return bytes length that have been received */
}


/*@}*/ /* end of group I2C_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group I2C_Driver */

/*@}*/ /* end of group Standard_Driver */
